<template>
  <h1>1 Есть два коренным образом отличающихся типа компьютеров: аналоговые и цифровые.
2 Цифровые компьютеры в основном манипулируют дискретными двоичными цифрами (1 и 0).
3 Они обычно более эффективны, чем аналоговые компьютеры по четырем основным причинам: они быстрее; они не настолько восприимчивы к внешним помехам; они могут передавать, огромные базы данных более точно; и их кодированные бинарные данные легче хранить и восстанавливать, чем аналоговые сигналы.
4 Цифровой компьютер является системой, состоящей из четырех функционально различных блоков: 1) центрального процессора (CPU), 2) входных устройств, 3) постоянно-запоминающих устройств, называемый дисководом, 4) выходных устройств. Эти физические части и все их физические компоненты являются аппаратными средствами.
5 Благодаря операционной системе компьютера аппаратные средства и программные системы могут работать одновременно.</h1>
</template>

<script>
export default {

}
</script>

<style>

</style>>